In [29]:
import pandas as pd
import numpy as np

In [30]:
df = pd.read_csv("../Data/co2_emission.csv")
df.head()

        Entity Code  Year  Annual CO₂ emissions (tonnes )
0  Afghanistan  AFG  1949                         14656.0
1  Afghanistan  AFG  1950                         84272.0
2  Afghanistan  AFG  1951                         91600.0
3  Afghanistan  AFG  1952                         91600.0
4  Afghanistan  AFG  1953                        106256.0

In [18]:
df['Entity'].value_counts()

Entity
Statistical differences      267
Asia and Pacific (other)     267
EU-28                        267
Europe (other)               267
Americas (other)             267
                            ...
Antarctic Fisheries           21
Wallis and Futuna Islands     17
Timor                         16
Christmas Island              14
Liechtenstein                 11
Name: count, Length: 233, dtype: int64

In [27]:
df.loc[df["Year"] < 1955]

            Entity Code  Year  Annual CO₂ emissions (tonnes )
0      Afghanistan  AFG  1949                         14656.0
1      Afghanistan  AFG  1950                         84272.0
2      Afghanistan  AFG  1951                         91600.0
3      Afghanistan  AFG  1952                         91600.0
4      Afghanistan  AFG  1953                        106256.0
...            ...  ...   ...                             ...
20789     Zimbabwe  ZWE  1945                       4462752.0
20790     Zimbabwe  ZWE  1946                       4312528.0
20791     Zimbabwe  ZWE  1947                       4037728.0
20792     Zimbabwe  ZWE  1948                       4536032.0
20793     Zimbabwe  ZWE  1949                       5129600.0

[7304 rows x 4 columns]

In [31]:
df.loc[df['Year'] == np.nan]

Empty DataFrame
Columns: [Entity, Code, Year, Annual CO₂ emissions (tonnes )]
Index: []

In [32]:
df.loc[df['Annual CO₂ emissions (tonnes )'] == np.nan]

Empty DataFrame
Columns: [Entity, Code, Year, Annual CO₂ emissions (tonnes )]
Index: []

In [33]:
df.isnull()

       Entity   Code   Year  Annual CO₂ emissions (tonnes )
0       False  False  False                           False
1       False  False  False                           False
2       False  False  False                           False
3       False  False  False                           False
4       False  False  False                           False
...       ...    ...    ...                             ...
20848   False  False  False                           False
20849   False  False  False                           False
20850   False  False  False                           False
20851   False  False  False                           False
20852   False  False  False                           False

[20853 rows x 4 columns]

In [ ]:
df